{
  "summary": {
    "title": "Summary",
    "content": "Full Stack Developer with solid experience across modern front-end frameworks (React, Next.js, Vue.js, Nuxt.js) and backend technologies (Node.js, Express, NestJS, FastAPI). Skilled in building scalable, high-performance web applications with clean architectures, intuitive user interfaces, and efficient API integrations. Focused on problem-solving, performance optimization, and delivering user-centered solutions through collaborative teamwork."
  },
  "experience": [
    {
      "title": "Software Engineer | Mid-Level Front End Developer → Full Stack Developer",
      "company": "Thresholdsa, Saudi Arabia",
      "period": "May 2025 - December 2025",
      "responsibilities": [
        "Developed and maintained ERP System full-stack web applications using Next.js and NestJS to build high-performance, scalable, and user-friendly solutions.",
        "Engineered a custom BMI (Body Mass Index) calculation algorithm for athletes, factoring in age, height, and weight to provide tailored health metrics and data-driven insights.",
        "Built and maintained robust backend services, developing scalable RESTful APIs with NestJS to handle server-side logic, database operations, and serve the calculation engine.",
        "Integrated frontend interfaces (React.js) with backend APIs to ensure a seamless data flow and dynamic user experience."
      ]
    },
    {
      "title": "Software Engineer | Mid-Level Front End Developer",
      "company": "ThresholdsSa, Saudi Arabia",
      "period": "December 2024 - May 2025",
      "responsibilities": [
        "Developed and maintained web applications using advanced technologies, including React.js, to build high-performance, scalable, and user-friendly solutions."
      ]
    },
    {
      "title": "Software Engineer | Front End Developer",
      "company": "We Solve It ApS, Denmark",
      "period": "August 2023 - January 2024",
      "responsibilities": [
        "Led multiple projects utilizing cutting-edge frameworks such as Vue.js and Nuxt.js to develop robust and dynamic web applications.",
        "Demonstrated expertise in leveraging Vue.js and Nuxt.js to create intuitive user interfaces and improve overall user experience.",
        "Successfully collaborated with cross-functional teams to deliver high-quality software solutions within specified deadlines."
      ]
    },
    {
      "title": "Software Engineer | Front End Developer",
      "company": "Freelancer, Saudi Arabia",
      "period": "March 2023 - April 2023",
      "project": {
        "name": "Eqra",
        "description": "A user-friendly platform for a school's library system and reader competitions, providing easy-to-use interfaces for children. The platform facilitated efficient library management and promoted a love for reading through engaging competitions."
      },
      "responsibilities": [
        "Created dashboards for school administrators that display competition and student statistics, which greatly simplifies the administration process for teachers and supervisors."
      ]
    },
    {
      "title": "Personal Project | Full Stack Developer",
      "company": "Gaza Sky Geeks, Gaza",
      "period": "January 2023 - March 2023",
      "project": {
        "name": "Vivo (Github)",
        "description": "Developed a social media website, where users can connect, shop and communicate seamlessly on a single platform."
      },
      "responsibilities": [
        "Utilized a wide range of technologies including Node.js, Express.js, React, PostgreSQL, and Socket.IO to build a robust and scalable Vivo.",
        "Developed a chat system utilizing Socket.IO for real-time communication.",
        "Developed an easy-to-use buying and selling system in my social media website to elevate the overall user experience and increase sales for business owners."
      ]
    },
    {
      "title": "Code Academy Final Project | Full Stack Developer",
      "company": "Gaza Sky Geeks, Gaza",
      "period": "November 2022 - December 2022",
      "project": {
        "name": "PMS (Github)",
        "description": "A complete system platform for managing pharmacies in the Gaza Strip, controlling resources, and identifying shortages and needs in the local market."
      },
      "responsibilities": [
        "Utilized a wide range of technologies including Node.js, Express.js, React, PostgreSQL, and unit testing to build a robust and scalable PMS.",
        "Conducted thorough unit testing and implemented robust error handling mechanisms, guaranteeing the reliability and stability of the PMS."
      ]
    }
  ],
  "education": [
    {
      "title": "Code Academy Bootcamp: Full Stack Web Developer",
      "institution": "Code Academy Bootcamp | Gaza Sky Geeks, Gaza, Palestine",
      "period": "August 2022 - January 2023",
      "achievements": [
        "Selected among over 1000 applicants, alongside 36 individuals, for an intensive 16-week course, demonstrating exceptional skills and potential in a competitive selection process.",
        "Acquired comprehensive knowledge and practical experience in various technologies, such as Node.js, Express.js, React, PostgreSQL, and Sequelize.",
        "Completed multiple projects throughout the bootcamp, applying newly acquired skills in real-world scenarios."
      ]
    },
    {
      "title": "Code Academy foundation course: Frontend Web Developer",
      "institution": "Gaza Sky Geeks, Gaza, Palestine",
      "period": "January 2022 - April 2022",
      "achievements": [
        "Selected among over 500 applicants, alongside 40 individuals, for an intensive 12-week course, demonstrating exceptional skills and potential in a competitive selection process.",
        "Acquired comprehensive knowledge and practical experience in various technologies, such as HTML5, CSS3, JS, DOM and BOM."
      ]
    },
    {
      "title": "Bachelor's",
      "institution": "Information Technology | University of Palestine, Gaza, Palestine",
      "period": "November 2021 - July 2025"
    },
    {
      "title": "Diploma",
      "institution": "Multimedia | University of Palestine, Gaza, Palestine",
      "period": "February 2019 - October 2021"
    }
  ]
}

